## Business Problem

####  We have taken a sample dataset for the Stores with very limited number of features .In this we have used Clustering Algorithm Kmeans to predict the category of the stores into Low ,Medium and High .
Data Collection and Preparation can include information like store names, locations, brand information, pricing data, customer reviews, or any other available data that describes the stores.

#### Load the Libraries

In [59]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [60]:
sns.set()
from sklearn.cluster import KMeans

#### Load the Data

In [61]:
data=pd.read_csv('Stores.csv')
data

       StoreName  Mall Name   Min Price  Max Price  Floor
0           Zara  Dubai Mall        500       2000      1
1          Mango  Dubai Mall        500       2000      1
2  Centre point   Dubai Mall         20        100      2
3            Max  Dubai Mall         20        100      2
4         Hand M  Dubai Mall        500       1500      1
5            Gap  Dubai Mall        500       1500      1
6          Gucci  Dubai Mall       7000      25000      3
7       Burberry  Dubai Mall       7000      20000      3
8           Dior  Dubai Mall       7000      30000      3

#### Select the features

In [62]:
x=data.iloc[:,2:5]
x

   Min Price  Max Price  Floor
0        500       2000      1
1        500       2000      1
2         20        100      2
3         20        100      2
4        500       1500      1
5        500       1500      1
6       7000      25000      3
7       7000      20000      3
8       7000      30000      3

#### Clustering method

In [63]:
kmeans=KMeans(3)#3 is the number of categories that we need to group then into ie :luxury,midrange and low range
kmeans.fit(x)

KMeans(n_clusters=3)

#### Clustering results

In [64]:
identified_clusters=kmeans.fit_predict(x)
identified_clusters

array([0, 0, 0, 0, 0, 0, 1, 2, 1])

In [65]:
data_clusters=data.copy()
data_clusters['Cluster']=identified_clusters
data_clusters

       StoreName  Mall Name   Min Price  Max Price  Floor  Cluster
0           Zara  Dubai Mall        500       2000      1        0
1          Mango  Dubai Mall        500       2000      1        0
2  Centre point   Dubai Mall         20        100      2        0
3            Max  Dubai Mall         20        100      2        0
4         Hand M  Dubai Mall        500       1500      1        0
5            Gap  Dubai Mall        500       1500      1        0
6          Gucci  Dubai Mall       7000      25000      3        1
7       Burberry  Dubai Mall       7000      20000      3        2
8           Dior  Dubai Mall       7000      30000      3        1

In [66]:
cat_map={0:'Low',1:'Medium',2:'High'}

In [67]:
data_clusters['Category']=data_clusters['Cluster'].replace(cat_map)

In [68]:
data_clusters

       StoreName  Mall Name   Min Price  Max Price  Floor  Cluster Category
0           Zara  Dubai Mall        500       2000      1        0      Low
1          Mango  Dubai Mall        500       2000      1        0      Low
2  Centre point   Dubai Mall         20        100      2        0      Low
3            Max  Dubai Mall         20        100      2        0      Low
4         Hand M  Dubai Mall        500       1500      1        0      Low
5            Gap  Dubai Mall        500       1500      1        0      Low
6          Gucci  Dubai Mall       7000      25000      3        1   Medium
7       Burberry  Dubai Mall       7000      20000      3        2     High
8           Dior  Dubai Mall       7000      30000      3        1   Medium

In [ ]:
#Based on the number of features that we have ,we can more accurately predict the category of the stores available.